import { Alphabet, WordsData } from '../types/mocks.type';

export const letters: Alphabet = ['А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ж', 'З', 'И', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ъ', 'Ы', 'Ь', 'Э', 'Ю', 'Я'];

export const words: WordsData[] = [
  {
    category: 'Еда' ,
    words: ['Cуп','Пюре','Котлета', 'Сыр', 'Йогурт', 'Салат', 'Гамбургер','Яблоко','Каша', 'Омлет', 'Печенье', 'Бифштекс', 'Шоколад', 'Пицца', 'Сосиски', 'Хлеб']
  },
  {
    category: 'Животные' ,
    words: ['Кошка','Баран','Жираф', 'Собака', 'Хомяк', 'Свинья', 'Корова', 'Волк', 'Носорог', 'Заяц', 'Черепаха', 'Панда', 'Тигр', 'Обезьяна', 'Леопард', 'Кабан']
  },
  {
    category: 'Транспорт' ,
    words: ['Автомобиль','Вертолет','Самокат', 'Автобус', 'Самолет', 'Велосипед', 'Такси', 'Маршрутка', 'Бричка', 'Метро', 'Мотоцикл', 'Мопед', 'Троллейбус', 'Поезд']
  },
  {
    category: 'Политика' ,
    words: ['Путин', 'Хохлы', 'Украина']
  },
  {
    category: 'Слово пацана' ,
    words: ['Чушпан', 'Адидас', 'Пацан', 'Казань', 'Маратик', 'Ералаш', 'Айгуль']
  },
  {
    category: 'Зосин лоток' ,
    words: ['Какашка', 'Понос', 'Писание', 'Наполнитель']
  }
];
